import cv2
import numpy as np

def main():
    """
    Основная функция для трекинга красного объекта.
    Выполняет все 5 заданий лабораторной работы.
    """

    # Инициализация видеопотока с камеры
    cap = cv2.VideoCapture(0)

    if not cap.isOpened():
        print("❌ Ошибка: не удалось открыть камеру")
        print("Проверьте подключение камеры и права доступа!")
        return
    
    print("✅ Успешно: камера запущена!")
    print("Управление: 'q' или 'ESC' для выхода")
    print("Поднесите красный объект к камере: 🟥👉🏻📷")

    # Создание структурного элемента для морфологических операций
    # Размер ядра влияет на степень фильтрации
    kernel = np.ones((5, 5), np.uint8)
    
    # Минимальная площадь объекта для фильтрации шума
    min_area = 500
    
    # Задание 1: Захват кадра с камеры
    while True:
        ret, frame = cap.read()
        
        if not ret:
            print("Ошибка чтения кадра")
            break
        
        # Конвертация из BGR в HSV цветовое пространство
        # HSV удобнее для работы с цветом, так как Hue отделен от яркости
        hsv = cv2.cvtColor(frame, cv2.COLOR_BGR2HSV)

    # Задание 2: Фильтрация красного цвета
        # Красный цвет занимает два диапазона на шкале Hue (0-10 и 170-180)
        # Это связано с тем, что красный находится на краях спектра
        
        # Нижний диапазон красного
        lower_red1 = np.array([0, 50, 50])
        upper_red1 = np.array([10, 255, 255])
        
        # Верхний диапазон красного
        lower_red2 = np.array([170, 50, 50])
        upper_red2 = np.array([180, 255, 255])
        
        # Создание масок для каждого диапазона
        mask1 = cv2.inRange(hsv, lower_red1, upper_red1)
        mask2 = cv2.inRange(hsv, lower_red2, upper_red2)
        
        # Объединение масок побитовой операцией OR
        mask = cv2.bitwise_or(mask1, mask2)
        
    # Задание 3: Морфологические преобразования
        # Морфологическое открытие удаляет мелкий шум (erosion -> dilation)
        opening = cv2.morphologyEx(mask, cv2.MORPH_OPEN, kernel, iterations=2)
        
        # Морфологическое закрытие заполняет дыры внутри объектов (dilation -> erosion)
        closing = cv2.morphologyEx(opening, cv2.MORPH_CLOSE, kernel, iterations=2)
        
        # Задание 4: Вычисление моментов изображения
        moments = cv2.moments(closing)
        
        # Проверка что объект обнаружен (площадь не равна нулю)
        if moments["m00"] > min_area:
            # Задание 5: Вычисление центроида и отрисовка прямоугольника
            
            # Вычисление координат центра масс объекта
            # Формулы: cx = M10/M00, cy = M01/M00
            cx = int(moments["m10"] / moments["m00"])
            cy = int(moments["m01"] / moments["m00"])
            
            # Площадь объекта (момент нулевого порядка)
            area = moments["m00"]
            
            # Поиск контуров для построения ограничивающего прямоугольника
            contours, _ = cv2.findContours(closing, cv2.RETR_EXTERNAL, 
                                          cv2.CHAIN_APPROX_SIMPLE)
            
            if len(contours) > 0:
                # Выбираем контур с максимальной площадью
                largest_contour = max(contours, key=cv2.contourArea)
                
                # Получаем координаты и размеры ограничивающего прямоугольника
                x, y, w, h = cv2.boundingRect(largest_contour)
                
                # Отрисовка черного прямоугольника вокруг объекта
                cv2.rectangle(frame, (x, y), (x + w, y + h), (0, 0, 0), 2)
                
                # Отрисовка центра объекта для визуализации
                cv2.circle(frame, (cx, cy), 5, (0, 255, 0), -1)
                
                # Вывод информации о площади
                cv2.putText(frame, f"Area: {int(area)}", (x, y - 10),
                           cv2.FONT_HERSHEY_SIMPLEX, 0.6, (0, 0, 0), 2)
                
                # Вывод координат центра
                cv2.putText(frame, f"Center: ({cx}, {cy})", (x, y + h + 20),
                           cv2.FONT_HERSHEY_SIMPLEX, 0.6, (0, 0, 0), 2)
        
        # Отображение результатов в отдельных окнах
        cv2.imshow('Original Frame', frame)
        cv2.imshow('HSV', hsv)
        cv2.imshow('Red Mask (Threshold)', mask)
        cv2.imshow('After Opening', opening)
        cv2.imshow('After Closing (Final)', closing)
        
        # Обработка нажатий клавиш
        key = cv2.waitKey(1) & 0xFF
        if key == ord('q') or key == 27:  # 'q' или ESC
            break
    
    # Освобождение ресурсов
    cap.release()
    cv2.destroyAllWindows()
    print("Программа завершена")

if __name__ == "__main__":
    main()
        